ch32-riscv-ug/ArduinoCore-CH32/variants/CH32V305/pins_arduino.h
/* ---- PWM: 12 pads on TIM1/TIM2/TIM3, default route ---- */
#define CH32_PWM_PIN_COUNT 12
#define CH32_PWM_PIN_TO_TIMER(p) ( \
    (p) == PA8 ? 1 : \
    (p) == PA9 ? 1 : \
    (p) == PA10 ? 1 : \
    (p) == PA11 ? 1 : \
    (p) == PA0 ? 2 : \
    (p) == PA1 ? 2 : \
    (p) == PA2 ? 2 : \
    (p) == PA3 ? 2 : \
    (p) == PA6 ? 3 : \
    (p) == PA7 ? 3 : \
    (p) == PB0 ? 3 : \
    (p) == PB1 ? 3 : \
    0)
#define CH32_PWM_PIN_TO_CHANNEL(p) ( \
    (p) == PA8 ? 1 : \
    (p) == PA9 ? 2 : \
    (p) == PA10 ? 3 : \
    (p) == PA11 ? 4 : \
    (p) == PA0 ? 1 : \
    (p) == PA1 ? 2 : \
    (p) == PA2 ? 3 : \
    (p) == PA3 ? 4 : \
    (p) == PA6 ? 1 : \
    (p) == PA7 ? 2 : \
    (p) == PB0 ? 3 : \
    (p) == PB1 ? 4 : \
    0)

/* ---- DAC: analogWrite() drives the converter on these pads,
 *      not a timer. ---- */
/* DAC1: on 3 of 4 parts */
#define CH32_DAC1_PIN PA4
/* DAC2: on every part */
#define CH32_DAC2_PIN PA5

/* ---- tone(): TIM7, free of PWM pads. ---- */
#define CH32_TONE_TIMER 7
#define CH32_TONE_TIMER_BASE CH32_TIM7_BASE
#define CH32_TONE_TIMER_CLKEN_ADDR 0x4002101cu
#define CH32_TONE_TIMER_CLKEN_MASK 0x00000020u
#define CH32_TONE_TIMER_IRQ CH32_IRQN_TIM7
#define CH32_TONE_TIMER_HANDLER TIM7_IRQHandler
#define CH32_TONE_SHARES_PWM 0
#define CH32_TONE_TIMER_BITS 16

/* ---- Servo: TIM6, free of PWM pads. ---- */
#define CH32_SERVO_TIMER 6
#define CH32_SERVO_TIMER_BASE CH32_TIM6_BASE
#define CH32_SERVO_TIMER_CLKEN_ADDR 0x4002101cu
#define CH32_SERVO_TIMER_CLKEN_MASK 0x00000010u
#define CH32_SERVO_TIMER_IRQ CH32_IRQN_TIM6
#define CH32_SERVO_TIMER_HANDLER TIM6_IRQHandler
#define CH32_SERVO_SHARES_PWM 0
#define CH32_SERVO_TIMER_BITS 16

/* No LED_BUILTIN: a Generic board is a silicon series, not a
 * board, so it does not know where an LED is. Define it yourself -
 * a product-board variant does it before including this header,
 * a sketch can do it on the command line:
 *   --build-property build.extra_flags=-DLED_BUILTIN=PC13
 * See docs/board-layer-rules.ja.md. */
